In [1]:
!pip install ipython-sql

Collecting ipython-sql
  Downloading ipython_sql-0.4.1-py3-none-any.whl (21 kB)
Requirement already satisfied: ipython>=1.0 in c:\users\adinda gita\anaconda3\lib\site-packages (from ipython-sql) (8.2.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\adinda gita\anaconda3\lib\site-packages (from ipython-sql) (1.4.32)
Requirement already satisfied: six in c:\users\adinda gita\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\adinda gita\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Collecting sqlparse
  Downloading sqlparse-0.4.2-py3-none-any.whl (42 kB)
Collecting prettytable<1
  Downloading prettytable-0.7.2.zip (28 kB)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\adinda gita\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.20)
Requirement already satisfied: matplotlib-inline in c:\users\adinda gita\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.2)
Requirement already satisfied: stack-data in c:\users\adinda gita\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: decorator in c:\users\adinda gita\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: pygments>=2.4.0 in c:\users\adinda gita\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.11.2)
Requirement already satisfied: jedi>=0.16 in c:\users\adinda gita\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.18.1)
Requirement already satisfied: setuptools>=18.5 in c:\users\adinda gita\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (61.2.0)
Requirement already satisfied: colorama in c:\users\adinda gita\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: pickleshare in c:\users\adinda gita\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: backcall in c:\users\adinda gita\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5 in c:\users\adinda gita\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\adinda gita\anaconda3\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.3)
Requirement already satisfied: wcwidth in c:\users\adinda gita\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\adinda gita\anaconda3\lib\site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.1.1)
Requirement already satisfied: asttokens in c:\users\adinda gita\anaconda3\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (2.0.5)
Requirement already satisfied: executing in c:\users\adinda gita\anaconda3\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (0.8.3)
Requirement already satisfied: pure-eval in c:\users\adinda gita\anaconda3\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (0.2.2)
Building wheels for collected packages: prettytable
  Building wheel for prettytable (setup.py): started
  Building wheel for prettytable (setup.py): finished with status 'done'
  Created wheel for prettytable: filename=prettytable-0.7.2-py3-none-any.whl size=13714 sha256=45e5cf2264f2b3308879aa132571550da1e9aa1275eea72220f560dd89d4e494
  Stored in directory: c:\users\adinda gita\appdata\local\pip\cache\wheels\75\f7\28\77a076f1fa8cbeda61aca712815d04d7a32435f04a26a2dd7b
Successfully built prettytable
Installing collected packages: sqlparse, prettytable, ipython-sql
Successfully installed ipython-sql-0.4.1 prettytable-0.7.2 sqlparse-0.4.2

WARNING: Retrying (Retry(total=4, connect=None, read=None, redirect=None, status=None)) after connection broken by 'ReadTimeoutError("HTTPSConnectionPool(host='pypi.org', port=443): Read timed out. (read timeout=15)")': /simple/ipython-sql/

In [3]:
!pip install pymysql
!pip install mysqlclient

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

WARNING: Retrying (Retry(total=4, connect=None, read=None, redirect=None, status=None)) after connection broken by 'ReadTimeoutError("HTTPSConnectionPool(host='pypi.org', port=443): Read timed out. (read timeout=15)")': /simple/pymysql/

Collecting mysqlclient
  Downloading mysqlclient-2.1.1-cp39-cp39-win_amd64.whl (178 kB)
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.1.1

In [1]:
import pymysql
import pandas as pd

In [2]:
conn=pymysql.connect(host='localhost',port=int(3306),user='root',passwd='Tsumtsuki1228',db='stockdb')

In [3]:
%load_ext sql

In [4]:
%sql mysql+mysqldb://AdindaGita:Tsumtsuki1228@localhost/stockdb

### Stock Data
Datas used in this analysis is the top 3 most quoted indices in America: Dow Jones, S&P 500 and Nasdaq Composite. The data include open, high, low and close index from July-2018 to June-2020. This analysis will try to usse SQL queries to look into highest and lowest of volume and prices. This analysis will also compare these 3 indices.

#### Dow Jones data

In [5]:
%%sql
SELECT * FROM dji LIMIT 10;

 * mysql+mysqldb://AdindaGita:***@localhost/stockdb
10 rows affected.

[('2022-06-17', 29912.7, 30167.52, 29653.29, 29888.78, 29888.78, 692830000),
 ('2022-06-16', 30305.74, 30305.74, 29740.35, 29927.07, 29927.07, 442910000),
 ('2022-06-15', 30570.5, 31011.97, 30185.08, 30668.53, 30668.53, 392670000),
 ('2022-06-14', 30592.34, 30690.8, 30144.23, 30364.83, 30364.83, 366800000),
 ('2022-06-13', 31144.91, 31144.91, 30373.72, 30516.74, 30516.74, 472290000),
 ('2022-06-10', 32053.52, 32053.52, 31387.84, 31392.79, 31392.79, 362300000),
 ('2022-06-09', 32828.62, 32956.73, 32267.78, 32272.79, 32272.79, 289710000),
 ('2022-06-08', 33087.07, 33156.5, 32824.37, 32910.9, 32910.9, 270470000),
 ('2022-06-07', 32783.03, 33207.45, 32641.85, 33180.14, 33180.14, 270750000),
 ('2022-06-06', 33032.04, 33235.37, 32819.5, 32915.78, 32915.78, 253010000)]

#### Nasdaq Composite Data

In [6]:
%%sql
SELECT * FROM ixic LIMIT 10;

 * mysql+mysqldb://AdindaGita:***@localhost/stockdb
10 rows affected.

[('2022-06-17', 10697.54981, 10884.70996, 10638.71973, 10798.34961, 10798.34961, 7423600000),
 ('2022-06-16', 10806.01953, 10831.07031, 10565.13965, 10646.09961, 10646.09961, 5667810000),
 ('2022-06-15', 10968.40039, 11244.25977, 10866.38965, 11099.15039, 11099.15039, 5346110000),
 ('2022-06-14', 10897.42969, 10926.80957, 10733.04004, 10828.34961, 10828.34961, 4802090000),
 ('2022-06-13', 10986.84961, 11071.48047, 10775.13965, 10809.23047, 10809.23047, 5912360000),
 ('2022-06-10', 11543.87988, 11569.15039, 11328.26953, 11340.01953, 11340.01953, 5125980000),
 ('2022-06-09', 12016.46973, 12115.05957, 11751.98047, 11754.23047, 11754.23047, 5382110000),
 ('2022-06-08', 12147.28027, 12235.78027, 12052.7002, 12086.26953, 12086.26953, 4689310000),
 ('2022-06-07', 11925.80957, 12194.86035, 11888.61035, 12175.23047, 12175.23047, 4383960000),
 ('2022-06-06', 12200.33008, 12245.40039, 12004.2002, 12061.37012, 12061.37012, 4633950000)]

#### S&P 500 Data

In [7]:
%%sql
SELECT * FROM snp LIMIT 10;

 * mysql+mysqldb://AdindaGita:***@localhost/stockdb
10 rows affected.

[('2022-06-17', 3665.9, 3707.71, 3636.87, 3674.84, 3674.84, 6954110000),
 ('2022-06-16', 3728.18, 3728.18, 3639.77, 3666.77, 3666.77, 4511200000),
 ('2022-06-15', 3764.05, 3837.56, 3722.3, 3789.99, 3789.99, 4474610000),
 ('2022-06-14', 3763.52, 3778.18, 3705.68, 3735.48, 3735.48, 4126400000),
 ('2022-06-13', 3838.15, 3838.15, 3734.3, 3749.63, 3749.63, 4572820000),
 ('2022-06-10', 3974.39, 3974.39, 3900.16, 3900.86, 3900.86, 3936120000),
 ('2022-06-09', 4101.65, 4119.1, 4017.17, 4017.82, 4017.82, 3192330000),
 ('2022-06-08', 4147.12, 4160.14, 4107.2, 4115.77, 4115.77, 3090180000),
 ('2022-06-07', 4096.47, 4164.86, 4080.19, 4160.68, 4160.68, 3476470000),
 ('2022-06-06', 4134.72, 4168.78, 4109.18, 4121.43, 4121.43, 3852050000)]

### Volume of each stock market
Volume is a measure of how much stocks traded in period of time. Volume could be an important information to see liquidity in market. Combined with technical indicator, trader could make a trading decision based on those informations.

#### Highest volume from each stock market

<u>Dow Jones overall average volume</u>

In [8]:
%%sql
SELECT AVG(Volume) FROM stockdb.dji

 * mysql+mysqldb://AdindaGita:***@localhost/stockdb
1 rows affected.

[(Decimal('347630661.3226'),)]

<u>Nasdaq Composite overall average volume</u>

In [9]:
%%sql
SELECT AVG(Volume) FROM stockdb.ixic

 * mysql+mysqldb://AdindaGita:***@localhost/stockdb
1 rows affected.

[(Decimal('3709327555.1102'),)]

<u>S&P 500 overall average volume</u>

In [10]:
%%sql
SELECT AVG(Volume) FROM stockdb.snp

 * mysql+mysqldb://AdindaGita:***@localhost/stockdb
1 rows affected.

[(Decimal('4020320290.5812'),)]

<u>Comparison of highest volume between Dow Jones, Nasdaq and S&P 500</u>

In [11]:
%%sql
SELECT * FROM dji WHERE Volume = (SELECT MAX(Volume) FROM stockdb.dji) 
	UNION SELECT * FROM ixic WHERE Volume = (SELECT MAX(Volume) FROM stockdb.ixic)
    UNION SELECT * FROM snp WHERE Volume = (SELECT MAX(Volume) FROM stockdb.snp);

 * mysql+mysqldb://AdindaGita:***@localhost/stockdb
3 rows affected.

[('2020-02-28', 25270.83, 25494.24, 24681.01, 25409.36, 25409.36, 915990000),
 ('2021-01-27', 13486.58008, 13538.41992, 13192.91016, 13270.59961, 13270.59961, 11102160000),
 ('2021-01-27', 3836.83, 3836.83, 3732.48, 3750.77, 3750.77, 9878040000)]

In [12]:
%%sql
SELECT * FROM stockdb.ixic WHERE Date like '2021-01-26'

 * mysql+mysqldb://AdindaGita:***@localhost/stockdb
1 rows affected.

[('2021-01-26', 13681.71973, 13702.69043, 13603.19043, 13626.05957, 13626.05957, 6781460000)]

### Highest and Lowest Price

#### Highest high and highest closing

In [13]:
%%sql
SELECT * FROM stockdb.dji WHERE High = (SELECT MAX(High) FROM stockdb.dji) 
	UNION SELECT * FROM stockdb.ixic WHERE High = (SELECT MAX(High) FROM stockdb.ixic)
    UNION SELECT * FROM stockdb.snp WHERE High = (SELECT MAX(High) FROM stockdb.snp);

 * mysql+mysqldb://AdindaGita:***@localhost/stockdb
3 rows affected.

[('2022-01-05', 36722.6, 36952.65, 36400.39, 36407.11, 36407.11, 462040000),
 ('2021-11-22', 16120.91992, 16212.23047, 15851.04004, 15854.75977, 15854.75977, 5531070000),
 ('2022-01-04', 4804.51, 4818.62, 4774.27, 4793.54, 4793.54, 3641050000)]

In [14]:
%%sql
SELECT * FROM stockdb.dji WHERE Close = (SELECT MAX(Close) FROM stockdb.dji) 
	UNION SELECT * FROM stockdb.ixic WHERE Close = (SELECT MAX(Close) FROM stockdb.ixic)
    UNION SELECT * FROM stockdb.snp WHERE Close = (SELECT MAX(Close) FROM stockdb.snp);

 * mysql+mysqldb://AdindaGita:***@localhost/stockdb
3 rows affected.

[('2022-01-04', 36636.0, 36934.84, 36636.0, 36799.65, 36799.65, 435080000),
 ('2021-11-19', 16042.16016, 16121.12012, 16017.23047, 16057.44043, 16057.44043, 4849160000),
 ('2022-01-03', 4778.14, 4796.64, 4758.17, 4796.56, 4796.56, 2775190000)]

In [15]:
%%sql
SELECT * FROM stockdb.dji ORDER BY High DESC LIMIT 5;

 * mysql+mysqldb://AdindaGita:***@localhost/stockdb
5 rows affected.

[('2022-01-05', 36722.6, 36952.65, 36400.39, 36407.11, 36407.11, 462040000),
 ('2022-01-04', 36636.0, 36934.84, 36636.0, 36799.65, 36799.65, 435080000),
 ('2021-12-30', 36522.48, 36679.44, 36372.13, 36398.08, 36398.08, 205620000),
 ('2022-01-03', 36321.59, 36595.82, 36246.45, 36585.06, 36585.06, 347930000),
 ('2021-12-29', 36421.14, 36571.55, 36396.19, 36488.63, 36488.63, 213480000)]

In [20]:
%%sql
SELECT * FROM stockdb.dji ORDER BY Close DESC LIMIT 5;

 * mysql+mysqldb://AdindaGita:***@localhost/stockdb
5 rows affected.

[('2022-01-04', 36636.0, 36934.84, 36636.0, 36799.65, 36799.65, 435080000),
 ('2022-01-03', 36321.59, 36595.82, 36246.45, 36585.06, 36585.06, 347930000),
 ('2021-12-29', 36421.14, 36571.55, 36396.19, 36488.63, 36488.63, 213480000),
 ('2021-11-08', 36416.46, 36565.73, 36334.42, 36432.22, 36432.22, 284400000),
 ('2022-01-05', 36722.6, 36952.65, 36400.39, 36407.11, 36407.11, 462040000)]

In [16]:
%%sql
SELECT * FROM stockdb.ixic ORDER BY High DESC LIMIT 5;

 * mysql+mysqldb://AdindaGita:***@localhost/stockdb
5 rows affected.

[('2021-11-22', 16120.91992, 16212.23047, 15851.04004, 15854.75977, 15854.75977, 5531070000),
 ('2021-11-19', 16042.16016, 16121.12012, 16017.23047, 16057.44043, 16057.44043, 4849160000),
 ('2021-11-05', 16003.55957, 16053.38965, 15900.78027, 15971.58984, 15971.58984, 5534130000),
 ('2021-11-08', 15995.71973, 16038.23047, 15961.80957, 15982.36035, 15982.36035, 5620280000),
 ('2021-11-09', 16024.12988, 16035.20996, 15836.67969, 15886.54004, 15886.54004, 5531330000)]

In [17]:
%%sql
SELECT * FROM stockdb.snp ORDER BY High DESC LIMIT 5;

 * mysql+mysqldb://AdindaGita:***@localhost/stockdb
5 rows affected.

[('2022-01-04', 4804.51, 4818.62, 4774.27, 4793.54, 4793.54, 3641050000),
 ('2021-12-30', 4794.23, 4808.93, 4775.33, 4778.73, 4778.73, 2390990000),
 ('2021-12-28', 4795.49, 4807.02, 4780.04, 4786.35, 4786.35, 2217050000),
 ('2021-12-29', 4788.64, 4804.06, 4778.08, 4793.06, 4793.06, 2369370000),
 ('2022-01-05', 4787.99, 4797.7, 4699.44, 4700.58, 4700.58, 3733540000)]

#### Lowest low and lowest closing

In [19]:
%%sql
SELECT * FROM stockdb.dji WHERE Low = (SELECT MIN(Low) FROM stockdb.dji) 
	UNION SELECT * FROM stockdb.ixic WHERE Low = (SELECT MIN(Low) FROM stockdb.ixic)
    UNION SELECT * FROM stockdb.snp WHERE Low = (SELECT MIN(Low) FROM stockdb.snp);

 * mysql+mysqldb://AdindaGita:***@localhost/stockdb
3 rows affected.

[('2020-03-23', 19028.36, 19121.01, 18213.65, 18591.93, 18591.93, 787970000),
 ('2018-12-24', 6278.490234, 6355.180176, 6190.169922, 6192.919922, 6192.919922, 1647270000),
 ('2020-03-23', 2290.71, 2300.73, 2191.86, 2237.4, 2237.4, 7402180000)]

In [24]:
%%sql
SELECT * FROM stockdb.dji WHERE Close = (SELECT MIN(Close) FROM stockdb.dji) 
	UNION SELECT * FROM stockdb.ixic WHERE Close = (SELECT MIN(Close) FROM stockdb.ixic)
    UNION SELECT * FROM stockdb.snp WHERE Close = (SELECT MIN(Close) FROM stockdb.snp);

 * mysql+mysqldb://AdindaGita:***@localhost/stockdb
3 rows affected.

[('2020-03-23', 19028.36, 19121.01, 18213.65, 18591.93, 18591.93, 787970000),
 ('2018-12-24', 6278.490234, 6355.180176, 6190.169922, 6192.919922, 6192.919922, 1647270000),
 ('2020-03-23', 2290.71, 2300.73, 2191.86, 2237.4, 2237.4, 7402180000)]

In [28]:
%%sql
SELECT * FROM stockdb.dji WHERE Date Like '2020-03-24' 
    UNION SELECT * FROM stockdb.ixic WHERE Date Like '2018-12-26'
    UNION SELECT * FROM stockdb.snp WHERE Date Like '2020-03-24'

 * mysql+mysqldb://AdindaGita:***@localhost/stockdb
3 rows affected.

[('2020-03-24', 19722.19, 20737.7, 19649.25, 20704.91, 20704.91, 799340000),
 ('2018-12-26', 6257.859863, 6555.529785, 6214.339844, 6554.359863, 6554.359863, 2558940000),
 ('2020-03-24', 2344.44, 2449.71, 2344.44, 2447.33, 2447.33, 7547350000)]